#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ACT-Terraform-Demos/demo-github-actions/runs/run-jeyvH8PP1z4kX3X7

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
2023-01-18T05:38:46.618Z [INFO]  Terraform version: 1.3.7
2023-01-18T05:38:46.619Z [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2023-01-18T05:38:46.619Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.15.0
2023-01-18T05:38:46.619Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-01-18T05:38:46.619Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2023-01-18T05:38:46.619Z [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-01-18T05:38:46.619Z [INFO]  Go runtime version: go1.19.4
2023-01-18T05:38:46.619Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:38:46.619Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.terraformrc
2023-01-18T05:38:46.619Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.terraformrc
2023-01-18T05:38:46.620Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.terraform.d/plugins"
2023-01-18T05:38:46.620Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-01-18T05:38:46.620Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.terraform.d/plugins
2023-01-18T05:38:46.620Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.local/share/terraform/plugins
2023-01-18T05:38:46.621Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-01-18T05:38:46.621Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-01-18T05:38:46.621Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:38:46.625Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-01-18T05:38:47.319Z [DEBUG] checking for provisioner in "."
2023-01-18T05:38:47.320Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/bin"
2023-01-18T05:38:47.320Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/.terraform.d/plugins"
2023-01-18T05:38:47.387Z [INFO]  backend/local: starting Plan operation
2023-01-18T05:38:47.646Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-01-18T05:38:47.646Z [DEBUG] Building and walking validate graph
2023-01-18T05:38:47.646Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:47.646Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:38:47.646Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:47.646Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:47.647Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:47.664Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:38:47.668Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=66
2023-01-18T05:38:47.668Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:38:47.720Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:47.720Z
2023-01-18T05:38:47.744Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin532294501 network=unix timestamp=2023-01-18T05:38:47.744Z
2023-01-18T05:38:47.744Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:47.880Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:47.880Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=66
2023-01-18T05:38:47.880Z [DEBUG] provider: plugin exited
2023-01-18T05:38:47.881Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:47.881Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:47.888Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:38:47.890Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=91
2023-01-18T05:38:47.890Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:38:47.905Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:47.904Z
2023-01-18T05:38:47.933Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin766935410 network=unix timestamp=2023-01-18T05:38:47.933Z
2023-01-18T05:38:47.933Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:47.968Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:47.968Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=91
2023-01-18T05:38:47.968Z [DEBUG] provider: plugin exited
2023-01-18T05:38:47.968Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg]
2023-01-18T05:38:47.968Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:38:47.969Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg]
2023-01-18T05:38:47.969Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web]
2023-01-18T05:38:47.969Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:38:47.969Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:38:47.969Z [DEBUG] Starting graph walk: walkValidate
2023-01-18T05:38:47.970Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:47.970Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:47.977Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:38:47.980Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=103
2023-01-18T05:38:47.980Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:38:47.993Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:47.992Z
2023-01-18T05:38:48.022Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin335207111 network=unix timestamp=2023-01-18T05:38:48.021Z
2023-01-18T05:38:48.022Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:48.055Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:48.056Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:48.065Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:38:48.068Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=115
2023-01-18T05:38:48.068Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:38:48.118Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:48.118Z
2023-01-18T05:38:48.146Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin713714679 network=unix timestamp=2023-01-18T05:38:48.146Z
2023-01-18T05:38:48.146Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:48.177Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:48.177Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=103
2023-01-18T05:38:48.177Z [DEBUG] provider: plugin exited
2023-01-18T05:38:48.326Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:38:48.326Z
2023-01-18T05:38:48.326Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:38:48.326Z
2023-01-18T05:38:48.329Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:48.329Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=115
2023-01-18T05:38:48.329Z [DEBUG] provider: plugin exited
2023-01-18T05:38:48.329Z [INFO]  backend/local: plan calling Plan
2023-01-18T05:38:48.329Z [DEBUG] Building and walking plan graph for NormalMode
2023-01-18T05:38:48.330Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.330Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.330Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: [random_pet.sg (expand)]
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand)]
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:38:48.330Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:38:48.331Z [DEBUG] Starting graph walk: walkPlan
2023-01-18T05:38:48.331Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:48.332Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:48.339Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:38:48.342Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=136
2023-01-18T05:38:48.342Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:38:48.355Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:48.355Z
2023-01-18T05:38:48.383Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:48.383Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin166690681 network=unix timestamp=2023-01-18T05:38:48.383Z
2023-01-18T05:38:48.415Z [DEBUG] created provider logger: level=debug
2023-01-18T05:38:48.416Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:38:48.423Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:38:48.426Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=148
2023-01-18T05:38:48.426Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:38:48.476Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:38:48.476Z
2023-01-18T05:38:48.500Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin311015615 network=unix timestamp=2023-01-18T05:38:48.500Z
2023-01-18T05:38:48.500Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:38:48.531Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
random_pet.sg: Refreshing state... [id=grateful-troll]
2023-01-18T05:38:48.536Z [WARN]  Provider "registry.terraform.io/hashicorp/random" produced an invalid plan for random_pet.sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .length: planned value cty.NumberIntVal(2) for a non-computed attribute
      - .separator: planned value cty.StringVal("-") for a non-computed attribute
2023-01-18T05:38:48.537Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:48.537Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=136
2023-01-18T05:38:48.537Z [DEBUG] provider: plugin exited
2023-01-18T05:38:48.675Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2023-01-18T05:38:48.677Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2023-01-18T05:38:48.677Z
2023-01-18T05:38:48.677Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:38:48.677Z
2023-01-18T05:38:48.677Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=b5299e988d48777f40c09d78bbda42d19e0ca9f57fea7408dc7d25436854a6dc
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T053848Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:38:48.677Z
2023-01-18T05:38:48.712Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:38:48 GMT
X-Amzn-Requestid: efd4dfcc-2123-4340-8689-2406dd2e8ac1


-----------------------------------------------------: timestamp=2023-01-18T05:38:48.712Z
2023-01-18T05:38:48.712Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>efd4dfcc-2123-4340-8689-2406dd2e8ac1</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:38:48.712Z
2023-01-18T05:38:48.713Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:38:48.712Z
2023-01-18T05:38:48.713Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=b5299e988d48777f40c09d78bbda42d19e0ca9f57fea7408dc7d25436854a6dc
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T053848Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:38:48.713Z
2023-01-18T05:38:48.733Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:38:47 GMT
X-Amzn-Requestid: 5f17694d-2385-4226-8c51-828e06c79ab2


-----------------------------------------------------: timestamp=2023-01-18T05:38:48.733Z
2023-01-18T05:38:48.733Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>5f17694d-2385-4226-8c51-828e06c79ab2</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:38:48.733Z
2023-01-18T05:38:48.735Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=1f5597ed7fe2f211bb19dbbff3f8fc917bbabf7d41f1b588930af24817f652e8
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T053848Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:38:48.735Z
2023-01-18T05:38:48.898Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 540
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:38:48 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: 0de0aef9-169a-4b14-a54d-9f5f680709c5


-----------------------------------------------------: timestamp=2023-01-18T05:38:48.898Z
2023-01-18T05:38:48.898Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeAccountAttributesResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>0de0aef9-169a-4b14-a54d-9f5f680709c5</requestId>
    <accountAttributeSet>
        <item>
            <attributeName>supported-platforms</attributeName>
            <attributeValueSet>
                <item>
                    <attributeValue>VPC</attributeValue>
                </item>
            </attributeValueSet>
        </item>
    </accountAttributeSet>
</DescribeAccountAttributesResponse>: timestamp=2023-01-18T05:38:48.898Z
2023-01-18T05:38:48.898Z [DEBUG] Resource instance state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:38:48.898Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: []
2023-01-18T05:38:48.899Z [DEBUG] refresh: aws_security_group.web-sg: no state, so not refreshing
2023-01-18T05:38:48.900Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:38:48.900Z
2023-01-18T05:38:48.900Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:38:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:38:48.900Z
2023-01-18T05:38:48.903Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.web-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(8080)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(8080)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2023-01-18T05:38:48.903Z [DEBUG] Resource instance state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:38:48.903Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: []
2023-01-18T05:38:48.903Z [DEBUG] refresh: aws_instance.web: no state, so not refreshing
2023-01-18T05:38:48.907Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_instance.web, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .user_data: planned value cty.StringVal("d36263b945850b1251dc22e4ed5c62aeb9e9e0f0") does not match config value cty.StringVal("#!/bin/bash\napt-get update\napt-get install -y apache2\nsed -i -e 's/80/8080/' /etc/apache2/ports.conf\necho \"Hello World\" > /var/www/html/index.html\nsystemctl restart apache2\n")
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-01-18T05:38:48.908Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:38:48.909Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=148
2023-01-18T05:38:48.909Z [DEBUG] provider: plugin exited
2023-01-18T05:38:48.909Z [DEBUG] building apply graph to check for errors
2023-01-18T05:38:48.909Z [DEBUG] Resource state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:38:48.909Z [DEBUG] Resource state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:38:48.910Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.910Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.910Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.910Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:38:48.910Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: []
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: []
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand) aws_instance.web aws_instance.web]
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg (expand)]
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg (expand) aws_security_group.web-sg aws_security_group.web-sg]
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:38:48.910Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:38:48.911Z [INFO]  backend/local: plan operation completed
2023-01-18T05:38:48.911Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-jeyvH8PP1z4kX3X7/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-01625be155ee390e9"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "grateful-troll-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pushed by: @dassiorleando, Action: `pull_request`*